---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.ChilledWaterLoopId
source: html/6dab9886-6d57-c8d5-1632-db3cf1336981.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.ChilledWaterLoopId Property

The chilled water loop used for the chilled water option of cooling coil.

## Syntax (C#)
```csharp
public ElementId ChilledWaterLoopId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null